from enum import Enum


AGREE = r"%CF%F0%E8%EC%E5%ED%E8%F2%FC"  # Применить. Аля ответ да. Like answer Yes

IMP_PEST = "w28_167"  # Призыв импа-вредителя

SCROLL = [
    "Свиток Воскрешения",
    "Свиток Выжигания Маны",
    "Свиток Светлого Удара",
    "Свиток Темного Удара",
    "Свиток Изгнания Из Боя",
    "Свиток Удар Ярости",
    "Свиток Излечения Союзника",
    "Свиток Завершения Боя",
    "Свиток Женской Злости",
    "Снежок",
]

TELEPORT_GIF = "i_w28_22"  # Телепорт

TELEPORT = {
    "Город Форпост": 1,
    "Город Октал": 2,
    "Деревня Подгорная": 3,
    "Окрестность Фейдана": 4,
    "Окрестность Октала": 5,
    "Окрестности Эринграда": 6,
    "Окрестность Форпоста": 7,
    "Пустыня Самум-Бейт": 8,
    "Северский Тракт": 9,
    "Восточные Леса": 10,
    "Окрестности Кенджии": 11,
    "Ущелье Эль-Тэр": 12,
}


class Teleport(Enum):
    FP = 1
    OKTAL = 2
    PODGORN = 3
    OKREST_FEIDANA = 4
    OKREST_OKTAL = 5
    OKREST_ERINGARD = 6
    OKREST_FP = 7
    SAMYM_BEYT = 8
    NORTHERN_TRACT = 9
    EASTERN_FORESTS = 10
    OKREST_KENGI = 11
    GORGE_EL_TER = 12
